In [1]:
import pandas as pd
import numpy as np

In [2]:
d={
    'Eng':np.random.randint(60,90,(10)),
    'Sci':np.random.randint(60,90,(10)),
    'Comp':np.random.randint(60,90,(10))
}

In [3]:
d

{'Eng': array([78, 66, 76, 70, 64, 76, 69, 74, 62, 70]),
 'Sci': array([83, 62, 82, 63, 87, 87, 79, 81, 69, 66]),
 'Comp': array([60, 87, 75, 61, 70, 67, 77, 84, 79, 63])}

In [4]:
dfdata=pd.DataFrame(d)

In [5]:
dfdata

   Eng  Sci  Comp
0   78   83    60
1   66   62    87
2   76   82    75
3   70   63    61
4   64   87    70
5   76   87    67
6   69   79    77
7   74   81    84
8   62   69    79
9   70   66    63

In [6]:
dfdata['Total']=dfdata['Eng']+dfdata['Sci']+dfdata['Comp']

In [7]:
dfdata

   Eng  Sci  Comp  Total
0   78   83    60    221
1   66   62    87    215
2   76   82    75    233
3   70   63    61    194
4   64   87    70    221
5   76   87    67    230
6   69   79    77    225
7   74   81    84    239
8   62   69    79    210
9   70   66    63    199

In [10]:
X=dfdata[['Eng','Sci','Comp']]

In [11]:
X

   Eng  Sci  Comp
0   78   83    60
1   66   62    87
2   76   82    75
3   70   63    61
4   64   87    70
5   76   87    67
6   69   79    77
7   74   81    84
8   62   69    79
9   70   66    63

In [9]:
y=dfdata['Total']

In [12]:
y

0    221
1    215
2    233
3    194
4    221
5    230
6    225
7    239
8    210
9    199
Name: Total, dtype: int32

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
Xtrain,Xtest,ytrain,ytest=train_test_split(X,y,test_size=0.2) # it splits taking random indexes

In [15]:
Xtrain

   Eng  Sci  Comp
5   76   87    67
3   70   63    61
0   78   83    60
9   70   66    63
2   76   82    75
4   64   87    70
6   69   79    77
1   66   62    87

In [16]:
ytrain

5    230
3    194
0    221
9    199
2    233
4    221
6    225
1    215
Name: Total, dtype: int32

In [17]:
Xtest

   Eng  Sci  Comp
8   62   69    79
7   74   81    84

In [18]:
ytest

8    210
7    239
Name: Total, dtype: int32

In [19]:
from sklearn.linear_model import LinearRegression

In [20]:
lreg=LinearRegression()

In [21]:
lreg

LinearRegression()

In [22]:
lreg.fit(Xtrain,ytrain)

LinearRegression()

In [23]:
lreg.score(Xtest,ytest)

1.0

In [24]:
lreg.score(Xtest,ytest)*100

100.0